
public class Test {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		
		/*大象装进冰箱里
		 * 
		 * schedule:日程
		 * 
		 * 面向过程：1,打开冰箱，2,存储大象，3,关上冰箱。
		 * 
		 * c语言就是标准的面向过程的语言。
		 * c++是面向对象语言。
		 * 
		 * 其实就是注重的内容不一样，面向过程思想，强调的是动作。
		 * 
		 *面向对象(重点掌握):
		 *		对于面向对象思想，强调的是对象。
		 * 		冰箱打开，冰箱存储，冰箱关闭。注重的是冰箱这个对象。
		 * 		冰箱将各种功能封装了。
		 * 		常见的有c++,java,c#
		 * 
		 * 特点：
		 * 1,面向对象就是一种常见的思想，符合人们的思考习惯。
		 * 2,面向对象的出现，将问题简单化了。
		 * 3,面向对象的出现，让曾经在过程中的执行者，变成了对象中的指挥者。
		 * 
		 * 怎么理解面向对象？
		 * java中一切都是对象，万物皆对象
		 * 面向对象三大特征：封装，继承，多态。
		 * 
		 * 人开门，对象是门，开门的动作定义在门里面。
		 * 怎么开门门自己最清楚。
		 * 人打开门可以理解人调用了门的开门的方法。
		 * 
		 * 比如说，用java描述汽车。
		 * 
		 * 怎么描述，一般关注两个方面，一个是属性，一个是行为。
		 * 
		 * 
		 * */
		
		
		
	}

}
